
//  Направете програма (main.c), в която да използва функцията за да преобразува примерни симовлни низове в числа. Демонстрирайте как се държи функцията и при въвеждане на невалиден символен низ. Компилирайте програмата като по време на компилацията включите обектния файл получен от първите три стъпки на компилация на сорс файла transformation.c. Запишете командите по компилация на transformation.c и на програмата main.c в отделен файл и го прикачете към заданието.


#include "transformation.h"
#include "transformation.c"
#include <stdio.h>

int main(){
    char c;
    printf("\n your char = ");
    scanf("%c", &c);
    struct Transformation newV;
    newV = intmaker(c);



}


